app/views/people/show.html.erb


		<% @person.logs.each do |log| %>
---
SELECT `logs`.* FROM `logs` WHERE `logs`.`person_id` = 1