app/views/equipment/show.html.erb


		<% @equipment.logs.each do |log| %>
---
SELECT `logs`.* FROM `logs` WHERE `logs`.`equipment_id` = 1