app/controllers/equipment_controller.rb

SELECT `equipment`.* FROM `equipment`
---
  def index
    @equipment = Equipment.all

INSERT INTO `equipment` (`name`, `created_at`, `updated_at`) VALUES ('gimbal', '2018-01-26 03:10:13', '2018-01-26 03:10:13')
---
  def create
    @equipment = Equipment.new(equipment_params)

    respond_to do |format|
      if @equipment.save

SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`id` = 1 LIMIT 1
---
    def set_equipment
      @equipment = Equipment.find(params[:id])