app/controllers/logs_controller.rb

  def index
    @logs = Log.all
---
SELECT `logs`.* FROM `logs`

  def create
    @log = Log.new
    @log.person=Person.find_by(name: log_params[:person])
    @log.equipment=Equipment.find_by(name: log_params[:equipment])

    respond_to do |format|
      if @log.save
---
SELECT  `equipment`.* FROM `equipment` WHERE `equipment`.`name` = 'gimbal' LIMIT 1
INSERT INTO `logs` (`person_id`, `equipment_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-01-26 03:20:46', '2018-01-26 03:20:46')

    def set_log
      @log = Log.find(params[:id])
---
SELECT  `logs`.* FROM `logs` WHERE `logs`.`id` = 2 LIMIT 1